{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"dense_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_17/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_10/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_3/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_4/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/conv2d_6/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/conv2d_8/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_11/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/conv2d_13/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/conv2d_15/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_18/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/conv2d_20/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/conv2d_22/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/batch_normalization_20/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/batch_normalization_20/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/batch_normalization_20/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/batch_normalization_20/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/conv2d_24/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/conv2d_23/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_9/conv2d_23/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/Cast", "op": "Cast", "input": ["input_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/batch_normalization/Cast", "StatefulPartitionedCall/model/batch_normalization/ReadVariableOp", "StatefulPartitionedCall/model/batch_normalization/ReadVariableOp_1", "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/re_lu/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/re_lu/Relu", "StatefulPartitionedCall/model/conv2d/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/conv2d/Conv2D", "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/re_lu_1/Relu", "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/conv2d_1/Conv2D", "StatefulPartitionedCall/model/residual_block/conv2d_3/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block/batch_normalization_2/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/conv2d_1/Conv2D", "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block/batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block/re_lu_2/Relu", "StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block/batch_normalization_3/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D", "StatefulPartitionedCall/model/residual_block/conv2d_2/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block/conv2d_4/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block/re_lu_3/Relu", "StatefulPartitionedCall/model/residual_block/conv2d_4/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block/add/add", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block/conv2d_3/Conv2D", "StatefulPartitionedCall/model/residual_block/conv2d_4/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block/add/add", "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"epsilon": {"f": 0.001}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "U": {"type": "DT_FLOAT"}, "exponential_avg_factor": {"f": 1.0}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_1/batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_1/re_lu_4/Relu", "StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/batch_normalization_5/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D", "StatefulPartitionedCall/model/residual_block_1/conv2d_5/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_1/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/conv2d_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_1/re_lu_5/Relu", "StatefulPartitionedCall/model/residual_block_1/conv2d_6/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_1/add_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/residual_block/add/add", "StatefulPartitionedCall/model/residual_block_1/conv2d_6/Conv2D"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_1/add_1/add", "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/re_lu_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_2/batch_normalization_6/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_2/re_lu_6/Relu", "StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/batch_normalization_7/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D", "StatefulPartitionedCall/model/residual_block_2/conv2d_7/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/re_lu_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_2/batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/conv2d_8/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_2/re_lu_7/Relu", "StatefulPartitionedCall/model/residual_block_2/conv2d_8/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_2/add_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/residual_block_1/add_1/add", "StatefulPartitionedCall/model/residual_block_2/conv2d_8/Conv2D"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_10/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_2/add_2/add", "StatefulPartitionedCall/model/residual_block_3/conv2d_10/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_2/add_2/add", "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/re_lu_8/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_3/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_3/re_lu_8/Relu", "StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/batch_normalization_9/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D", "StatefulPartitionedCall/model/residual_block_3/conv2d_9/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/re_lu_9/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_3/batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/conv2d_11/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_3/re_lu_9/Relu", "StatefulPartitionedCall/model/residual_block_3/conv2d_11/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_3/add_3/add", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_3/conv2d_10/Conv2D", "StatefulPartitionedCall/model/residual_block_3/conv2d_11/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_3/add_3/add", "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/re_lu_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_4/batch_normalization_10/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_4/re_lu_10/Relu", "StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/batch_normalization_11/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D", "StatefulPartitionedCall/model/residual_block_4/conv2d_12/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/re_lu_11/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_4/batch_normalization_11/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/conv2d_13/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_4/re_lu_11/Relu", "StatefulPartitionedCall/model/residual_block_4/conv2d_13/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_4/add_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/residual_block_3/add_3/add", "StatefulPartitionedCall/model/residual_block_4/conv2d_13/Conv2D"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_4/add_4/add", "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/re_lu_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_5/batch_normalization_12/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_5/re_lu_12/Relu", "StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/batch_normalization_13/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D", "StatefulPartitionedCall/model/residual_block_5/conv2d_14/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/re_lu_13/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_5/batch_normalization_13/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/conv2d_15/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_5/re_lu_13/Relu", "StatefulPartitionedCall/model/residual_block_5/conv2d_15/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_5/add_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/residual_block_4/add_4/add", "StatefulPartitionedCall/model/residual_block_5/conv2d_15/Conv2D"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_17/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_5/add_5/add", "StatefulPartitionedCall/model/residual_block_6/conv2d_17/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_5/add_5/add", "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/re_lu_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_6/batch_normalization_14/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_6/re_lu_14/Relu", "StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/batch_normalization_15/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D", "StatefulPartitionedCall/model/residual_block_6/conv2d_16/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/re_lu_15/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_6/batch_normalization_15/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/conv2d_18/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_6/re_lu_15/Relu", "StatefulPartitionedCall/model/residual_block_6/conv2d_18/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_6/add_6/add", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_6/conv2d_17/Conv2D", "StatefulPartitionedCall/model/residual_block_6/conv2d_18/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_6/add_6/add", "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/re_lu_16/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_7/batch_normalization_16/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_7/re_lu_16/Relu", "StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/batch_normalization_17/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D", "StatefulPartitionedCall/model/residual_block_7/conv2d_19/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/re_lu_17/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_7/batch_normalization_17/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/conv2d_20/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_7/re_lu_17/Relu", "StatefulPartitionedCall/model/residual_block_7/conv2d_20/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_7/add_7/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/residual_block_6/add_6/add", "StatefulPartitionedCall/model/residual_block_7/conv2d_20/Conv2D"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/residual_block_7/add_7/add", "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/ReadVariableOp_1", "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/re_lu_18/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_8/batch_normalization_18/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/residual_block_8/re_lu_18/Relu", "StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/batch_normalization_19/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D", "StatefulPartitionedCall/model/residual_block_8/conv2d_21/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model/residual_block_8/re_lu_19/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/residual_block_8/batch_normalization_19/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, 