{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_49": {"name": "keras_tensor_49:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}, {"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "keras_tensor_49", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/Cast", "op": "Cast", "input": ["keras_tensor_49"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/Cast", "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_11_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_11_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_11_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_12_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_12_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_12_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_12_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_13_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_13_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_13_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_13_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_14_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_14_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_14_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_14_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_14_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_14_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_15_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_15_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_15_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_15_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_15_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_15_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_16_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_16_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_16_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_16_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_16_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_16_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_17_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_17_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_17_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_17_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_17_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_17_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_18_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_18_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_18_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_18_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_18_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_18_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_19_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_19_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_19_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_19_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_19_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_19_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_20_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_20_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_20_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_20_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/Cast", "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_20_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_20_1/Relu", "StatefulPartitionedCall/functional_2_1/conv2d_21_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_21_1/convolution", "StatefulPartitionedCall/functional_2_1/conv2d_21_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/conv2d_21_1/BiasAdd"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Cast", "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Mean"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/re_lu_21_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Cast_1"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_2_1/re_lu_21_1/Relu", "StatefulPartitionedCall/functional_2_1/dense_2_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/dense_2_1/MatMul", "StatefulPartitionedCall/functional_2_1/dense_2_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_2_1/dense_2_1/BiasAdd", "StatefulPartitionedCall/functional_2_1/dense_3_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_2_1/dense_3_1/MatMul", "StatefulPartitionedCall/functional_2_1/dense_3_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_2_1/dense_3_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_2_1/dense_3_1/Softmax"], "attr": {"T": {"type": "DT_HALF"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/convolution/Cast", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_11_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_10_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/convolution/Cast", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_12_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_11_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_13_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_12_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_14_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_13_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_15_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_14_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/convolution/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_16_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_15_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_17_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_16_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_18_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_17_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_19_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_18_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_20_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/batch_normalization_19_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/conv2d_21_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/global_average_pooling2d_1_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/Cast/Cast", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_2_1/BiasAdd/Cast", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/Cast/Cast", "shape": [128, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_2_1/dense_3_1/BiasAdd/Cast", "shape": [62], "dtype": "float32"}]}]}