{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_112": {"name": "keras_tensor_112:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_3_1/conv2d_25_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_26_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_27_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_28_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_29_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_30_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_31_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_32_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_33_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_34_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_35_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_36_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_37_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_38_1/convolution/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_4_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_5_1/Cast/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}, {"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_5_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "keras_tensor_112", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/Cast", "op": "Cast", "input": ["keras_tensor_112"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_25_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/Cast", "StatefulPartitionedCall/functional_3_1/conv2d_25_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_25_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_29_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_29_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_30_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_26_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_30_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_26_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_26_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_31_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_27_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_31_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_27_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_27_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_32_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_28_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_32_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_28_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_28_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_33_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_29_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_33_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_29_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_29_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_34_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_30_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_34_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_30_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_30_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_35_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_31_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_35_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_31_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_31_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_36_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_32_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_36_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_32_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_32_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_37_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_33_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_37_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_33_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_33_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_38_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_34_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_38_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_34_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_34_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_39_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_35_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_39_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_35_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_35_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_40_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_36_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_40_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_36_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_36_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_41_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_37_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_41_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_37_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_37_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_42_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_42_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_38_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_42_1/Relu", "StatefulPartitionedCall/functional_3_1/conv2d_38_1/convolution/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/conv2d_38_1/convolution"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_43_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_43_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_43_1/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Cast", "StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Mean"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/global_average_pooling2d_2_1/Cast_1"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/Cast", "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/Cast_5", "op": "Cast", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/batchnorm/add_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/re_lu_44_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_3_1/batch_normalization_44_1/Cast_5"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_4_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_3_1/re_lu_44_1/Relu", "StatefulPartitionedCall/functional_3_1/dense_4_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_5_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_3_1/dense_4_1/MatMul", "StatefulPartitionedCall/functional_3_1/dense_5_1/Cast/Cast"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_5_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_3_1/dense_5_1/MatMul", "StatefulPartitionedCall/functional_3_1/dense_5_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/functional_3_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_3_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_3_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_HALF"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_3_1/conv2d_25_1/convolution/Cast", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_29_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_30_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_26_1/convolution/Cast", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_31_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_27_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_32_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_28_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_33_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_29_1/convolution/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_34_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_30_1/convolution/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_35_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_31_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_36_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_32_1/convolution/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_37_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_33_1/convolution/Cast", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_38_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_34_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_39_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_35_1/convolution/Cast", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_40_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_36_1/convolution/Cast", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/batch_normalization_41_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_3_1/conv2d_37_1/convolution/Cast", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": 