{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3136"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Cast", "op": "Cast", "input": ["input_2"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Cast", "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D", "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Relu", "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"epsilon": {"f": 0.001}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "exponential_avg_factor": {"f": 1.0}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D", "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/sequential_1/conv2d_5/Relu", "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"epsilon": {"f": 0.001}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "exponential_avg_factor": {"f": 1.0}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D", "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/sequential_1/conv2d_6/Relu", "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"epsilon": {"f": 0.001}, "data_format": {"s": "TkhXQw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_HALF"}, "exponential_avg_factor": {"f": 1.0}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D", "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/sequential_1/conv2d_7/Relu", "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp_1", "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp", "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp_1"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/sequential_1/flatten_1/Const"], "attr": {"T": {"type": "DT_HALF"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_2/MatMul/Cast"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_HALF"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_1/dense_2/MatMul", "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/sequential_1/dense_2/Relu"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_3/Cast", "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_3/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/Cast", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/Cast", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/ReadVariableOp_1", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/ReadVariableOp_1", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/Cast", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/Cast", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/ReadVariableOp_1", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/ReadVariableOp_1", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/Cast", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/Cast", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/ReadVariableOp_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/ReadVariableOp_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/Cast", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/Cast", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/ReadVariableOp_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/ReadVariableOp_1", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/Cast", "shape": [3136, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/Cast", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "shape": [128, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}