{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"conv2d_14_input": {"name": "conv2d_14_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"dense_7": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/flatten_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6272"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_14_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["conv2d_14_input", "StatefulPartitionedCall/sequential_3/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/conv2d_14/Relu", "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_15/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3", "StatefulPartitionedCall/sequential_3/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/conv2d_15/Relu", "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/max_pooling2d_7/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_16/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_3/max_pooling2d_7/MaxPool", "StatefulPartitionedCall/sequential_3/conv2d_16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/conv2d_16/Relu", "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_17/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3", "StatefulPartitionedCall/sequential_3/conv2d_17/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_3/conv2d_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/conv2d_17/Relu", "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/max_pooling2d_8/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3/flatten_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_3/max_pooling2d_8/MaxPool", "StatefulPartitionedCall/sequential_3/flatten_3/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/flatten_3/Reshape", "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_3/dense_6/Relu", "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/mul_1", "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/add_1", "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_3/dense_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/dense_7/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/conv2d_14/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_14/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_15/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_15/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_16/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_16/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_17/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/conv2d_17/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/flatten_3/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/MatMul/ReadVariableOp", "shape": [6272, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_6/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_21/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/MatMul/ReadVariableOp", "shape": [256, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_7/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_18/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_17/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_20/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/batch_normalization_19/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}]}]}