{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_9": {"name": "input_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"activation_8": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_8/conv2d_85/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_85/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/global_average_pooling2d_8/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_9", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Cast", "op": "Cast", "input": ["input_9"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/conv2d_77/Cast", "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_69/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_77/Conv2D", "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_69/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_69/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_78/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_69/Relu", "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_70/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_78/Conv2D", "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_70/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_70/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_79/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_70/Relu", "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_71/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_79/Conv2D", "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_71/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_71/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_80/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_71/Relu", "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_72/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_80/Conv2D", "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_72/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_72/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_81/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_72/Relu", "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_73/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_81/Conv2D", "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_73/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_73/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_82/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_73/Relu", "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_74/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_82/Conv2D", "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_74/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_74/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_83/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_74/Relu", "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_75/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_83/Conv2D", "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_75/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_75/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_84/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_75/Relu", "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/batch_normalization_76/FusedBatchNormV3", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_84/Conv2D", "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_bn_offset"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/re_lu_76/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_8/batch_normalization_76/FusedBatchNormV3"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_85/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_8/re_lu_76/Relu", "StatefulPartitionedCall/model_8/conv2d_85/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_8/conv2d_85/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_8/conv2d_85/Conv2D", "StatefulPartitionedCall/model_8/conv2d_85/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/model_8/global_average_pooling2d_8/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_8/conv2d_85/BiasAdd", "StatefulPartitionedCall/model_8/global_average_pooling2d_8/Mean/reduction_indices"], "attr": {"T": {"type": "DT_HALF"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_8/activation_8/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model_8/global_average_pooling2d_8/Mean"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_8/activation_8/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_8/activation_8/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_8/activation_8/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_8/conv2d_85/Conv2D/Cast", "shape": [1, 1, 128, 62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_85/BiasAdd/Cast", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/global_average_pooling2d_8/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_weights", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_77/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_weights", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_78/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_79/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_80/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_81/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_weights", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_82/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_83/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_8/conv2d_84/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}]}]}